import React, { useState } from 'react';
import './Diagram.css';
import PopUp from './PopUp';

const Diagram = () => {
  const [isPopupVisible, setPopupVisible] = useState(false);
  const [popupContent, setPopupContent] = useState({ title: '', content: '', color: '' });

  const handleBoxClick = (title, content, color) => {
    setPopupContent({ title, content, color });
    setPopupVisible(true);
  };

  const closePopup = () => {
    setPopupVisible(false);
  };

  const handlePrintDiagramClick = () => {
    window.open(`${process.env.PUBLIC_URL}/מבנה הרשות המקומית בשעת חירום.pdf`, '_blank');
  };

  return (
    <div className="diagram-container">
      <h1 className="diagram-title">מבנה הרשות המקומית בשעת חירום</h1>
      <div className="subtitle-diagram">
        בכדי לפעול באופן מיטבי בשעת חירום, הרשות המקומית משנה תצורה ופעולת במכלולים המחולקים לתחומי אחריות.
        <br /><br />
        בלחיצה על כל רכיב יפתח חלון עם הסבר נוסף -
      </div>

      <img src={process.env.PUBLIC_URL + '/hpArrow.png'} class="hpArrow-diagram" alt="Ogen"></img>

      <div className='all-diagram'>

        <div className="line"></div>

        <div className="frame"
          onClick={() => handleBoxClick('ראש הרשות',
            (<>
              Detailed information about ראש הרשות
            </>),
            '#555555')}
        >
          <p className="frame-text">ראש הרשות</p>
        </div>

        <div
          className="black-frame"
          onClick={() => handleBoxClick('מנכל הרשות\ ר"מט',
            (<>
              Detailed information about מנכל הרשות\ ר"מט'
            </>),
            '#000000')}
        >
          <p className="black-frame-text">מנכל הרשות\ ר"מט</p>
        </div>

        <div className="colored-box blue-box" onClick={() => handleBoxClick('אגף חירום וביטחון',
          (<>
            Detailed information about אגף חירום וביטחון
          </>)
          ,
          '#6daae2')}>
          <p className="colored-box-text">אגף חירום וביטחון </p>
        </div>

        <div className="colored-box orange-box" onClick={() => handleBoxClick('יק"לר',
          (<>
            Detailed information about יק"לר
          </>)
          , '#d87b3c')}>
          <p className="colored-box-text">יק"לר</p>
        </div>

        <div className="colored-box red-box" onClick={() => handleBoxClick('כוחות ביטחון',
          (<>
            Detailed information about כוחות ביטחון
          </>)
          , '#db3f3f')}>
          <p className="colored-box-text">כוחות ביטחון</p>
        </div>

        <div className="colored-box-sub" onClick={() => handleBoxClick('מכלול אוכלוסייה',
          (<>
            <b>מתן מענה לתושבי הרשות ע"פ יעדי השירות בתחומים: רווחה, בריאות, פס"ח ודת
            </b>
            <ul>
              <li>גיבוש תמונת מצב והערכת מצב האוכלוסייה ברשות, חיזוי התנהגותה וצרכיה וגיבוש תוכניות פעולה בהתאם;
              </li>
              <li>
                העברת נתונים על האוכלוסייה באזור האירוע ומסירתם לגוף החירום המנהל את האירוע (צה"ל-פיקוד העורף או משטרת ישראל)
              </li>
              <li>
                איתור ואבחון קבוצות אוכלוסייה הנזקקות לסיוע לאור המצב ומתן המענה הנדרש בתיאום עם מטה החירום הרשותי;
              </li>
              <li>
                תיאום עם הגורמים המקצועיים החיצוניים לרשות בכל הקשור למתן שירותים לאוכלוסייה, כגון קופות החולים, משרד הבריאות הנפתית/מחוזית, משרד הרווחה, משרד עלייה וקליטה, מועצות דתיות, חברות קבורה, המוסד לביטוח לאומי, משרד הבריאות, קצין ההתנהגות ביקל"ר;
              </li>
              <li>זימון וריכוז פעילות הוועדה לפס"ח;
              </li>
              <li>זימון וריכוז פעילות הוועדה להתנדבות;
              </li>
              <li>ניהול מתקני הקליטה של מפונים חסרי קורת גג - בהתייעצות עם ועדת פס"ח;
              </li>
              <li>פתיחת תחנת ריכוז חללים מקומית/מרחבית לפי הנחיית רשות פס"ח;
              </li>
              <li>מתן מענה לצורכי התושבים באמצעות מערך המתנדבים ומערכים קהילתיים
              </li>
            </ul>
          </>)
          , '#044188')}>
          <p className="colored-box-text">מכלול אוכלוסייה</p>
        </div>

        <div className="colored-box-sub" onClick={() => handleBoxClick('מכלול החינוך',
          (<>
            <b>מתן מענה לתושבי הרשות ע"פ יעדי השירות בתחומי החינוך וקביעת מתכונת הפעלת מסגרות החינוך הפורמלי והבלתי פורמלי ע"פ ההנחיות
            </b>
            <ul>
              <li>הפעלת מערכת החינוך הרשותית בהתאם להחלטות ראש הרשות ומטה החירום הרשותי והנחיות פיקוד העורף
              </li>
              <li>להעלות צרכים ודרישות למחוז משרד החינוך בסיוע המפקח המתכלל הרשותי
              </li>
              <li>לסייע למכלול אוכלוסייה בקליטת אוכלוסייה מפונה במוסדות חינוך המשמשים כמתקני קליטה - על-פי נוהל 24 של פס"ח ונוהל 13 ב"חוזר מנכ"ל משרד החינוך לשעת-חירום"
              </li>
              <li>לשלב את מוסדות הקהילה, מתנ''ס ומנו''ס (מנהל נוער וספורט) במענים ובפתרונות לצורכי מערכת החינוך
              </li>
              <li>להפעיל את מערך ההסעות לתלמידים בהתאם לפעילות מוסדות החינוך ובתיאום עם מכלול לוגיסטיקה
              </li>
              <li>להפעיל תכניות חירום בתחומים הבאים: תכנית למידה בחירום, תוכנית למידה מרחוק, תוכניות הפגה, הפעלת בני נוער מתנדבים, תמיכה נפשית ועוד</li>
            </ul>
          </>)
          , '#044188')}>
          <p className="colored-box-text">מכלול החינוך</p>
        </div>

        <div className="colored-box-sub" onClick={() => handleBoxClick('מכלול הנדסה ותשתיות',
          (<>
          <b>מתן מענה לתושבי הרשות ע"פ יעדי השירות בתחומי הנדסה, חשמל, מים וביוב, דרכים והגנת הסביבה</b>
          <ul>
            <li>הערכת נזקים במבנים ובתשתיות לאחר אירוע באמצעות מהנדסים ואדריכלים המוכשרים לכך וגיבוש המלצה הנדסית על מבנים שנפגעו באשר לאפשרות החזרת האוכלוסייה להתגורר בהם והמשך הטיפול
            </li>
            <li>המשך מתן שירותים מוניציפליים חיוניים לאוכלוסייה בתחומי מים, ביוב, דרכים, ניקוז ובינוי
            </li>
            <li>הפעלת "צוותי שטח הנדסה ותשתיות" של הרשות
            </li>
            <li>הפעלת תכנית גיבוי לאספקת מים חלופיים בתחנות חלוקה. באזורים השונים של הרשות והפעלתה באזור שנפגע
            </li>
            <li>הפעלת גנרטורים כגיבוי לאספקת חשמל, לאתרי קליטה ולמתקנים נוספים שבאחריות הרשות ולסיוע במוקדי האירוע</li>
            <li>תיאום תיקון מהיר של דרכים, של מבנים ושל תשתיות חיוניות על ידי צוותי השטח או על ידי קבלנים להבטחת צירים פנויים וכדי לאפשר את החזרת שגרת החיים מהר ככל הניתן
            </li>
            <li>עדכון מכלול המידע לציבור במידע הנחוץ לציבור בתחומי עיסוק המכלול, כגון: מיקום פריסת מכלי מים ניידים, תיקון מבנים וצירים חסומים ופנויים ועוד
            </li>
            <li>קיום יחסי גומלין עם מחזיקי חומ"ס במרחב הרשות
            </li>
            <li>מיפוי וטיפול במפגעים סביבתיים (בתאום עם מחוז הגנ"ס), כגון: אויר, אסבסט, זיהום חופים, קרינה, סביבה חקלאית, שפכים וקרקעות מזוהמות (פסולת ומזיקים מטופלים במכלול לוגיסטיקה)
            </li>
          </ul>
          </>)
          , '#044188')}>
          <p className="colored-box-text">מכלול הנדסה ותשתיות</p>
        </div>

        <div className="colored-box-sub" onClick={() => handleBoxClick('מכלול לוגיסטיקה ותפעול',
          (<>
            <b>מתן מענה לוגיסטי, בהתאם לרמות השירות שנקבעו לחירום, בתחומי השירותים הלוגיסטיים והשירותים החיוניים הקשורים ב: מזון, דלק, גפ"ם, תובלה, צמ"ה, היסעים, פיקוח, משכ"ל, מחסנים.
            </b>
            <ul>
              <li>תמיכה לוגיסטית בכוחות העירייה הפועלים בחירום, ניהול השירותים הלוגיסטיים והתפעוליים של העיר (כגון מזון לעובדים, דלק, רכב, צמ"ה, היסעים, תובלה יבשתית, גנרטורים), לרבות בעת אירוע;
              </li>
              <li>ניהול מחסני החירום (ציוד למתקני קליטה, אמצעֵי תאורת חירום, גנרטורים) ומלאי החירום של הרשות בדלק וגפ"ם, ציוד וחלפים הדרושים לפעילות בעיר;</li>
              <li>תפעול מערך ההיסעים של העירייה, לרבות ביצוע ההסעות של מערכת החינוך בהתאם לתוכנית, בכפוף למדיניות החירום, ביצוע הסעות לעובדי העירייה לאיוש המשמרות ברציפות וסיוע לפעילות שבאחריות העירייה;
              </li>
              <li>שינוע ציוד ממחסני החירום העירוניים (לרבות ממחסני פס"ח העירוניים והמחוזיים);
              </li>
              <li>מסירת מידע לאוכלוסייה, באמצעות מכלול המידע לציבור על מערך שירותים חיוניים, כגון: מרכולים, תחבורה ציבורית, דלק וגפ"ם, בנקאות, דואר, משרדי ממשלה ובנקים הפתוחים בחירום, שיאפשרו ניהול שגרת חירום;
              </li>
              <li>מתן שירותי תברואה לאוכלוסייה ולעסקים;
              </li>
            </ul>
          </>)
          , '#044188')}>
          <p className="colored-box-text">מכלול לוגיסטיקה ותפעול</p>
        </div>

        <div className="colored-box-sub" onClick={() => handleBoxClick('מכלול משא"ן ומנהל כללי',
          (<>
          <b>מתן מענה כללי בהתאם לרמות השירות שנקבעו לחירום בהיבטים: כוח האדם, התיירים, התקשוב.
          </b>
          <ul>
            <li>גיבוש תמ"ץ בנושא כוח אדם, תיירות ותקשוב ברשות המקומית
            </li>
            <li>השלמות איוש או תגבור כוח האדם בגופי הרשות בהתאם לצורכי החירום, על-ידי השמת עובדים מרותקים משקיים</li>
            <li>מתן שירותי תברואה והגנת הסביבה לאוכלוסייה ולעסקים
            </li>
            <li>טיפול בתיירים בהתאם למדיניות הממשלה
            </li>
            <li>מתן מענה תקשובי לרשות ווידוא אבטחת מערכות המידע כנגד איומי הסייבר</li>
          </ul>
          </>)
          , '#044188')}>
          <p className="colored-box-text"> מכלול משא"ן ומנהל כללי</p>
        </div>

      </div>


      <PopUp
        isVisible={isPopupVisible}
        onClose={closePopup}
        title={popupContent.title}
        content={popupContent.content}
        color={popupContent.color} // Pass color to the popup component
      />

      <div className='btn-print-diagram' onClick={handlePrintDiagramClick}>
        <img src={process.env.PUBLIC_URL + '/print.png'} className="print-img-diagram" alt="print"></img>
        <p className='text-print'>הורדת גרסה להדפסה</p>
      </div>

    </div>
  );
};

export default Diagram;
